// Переменные.

#include <iostream>
#include <conio.h>

using namespace std;

// main
int main_Variable()
{
	// Определение (definition) переменной:
	//   int - тип (целочисленный, со знаком, 4 байта).
	//   a - имя переменной.
	//   = 10 - инициализация переменной.
	int a = 10;

	// Вывод значения переменной:
	cout << "a = ";
	cout << a;
	cout << endl; // endl - конец строки

	// Можно записать короче:
	cout << "a = " << a << endl;

	// Переменная без инициализации. В ней сейчас мусор.
	// Лучше сразу чем-нибудь заполнять.
	int b;

	// Формально так написать можно, но многие компиляторы выдадут предупреждение о том,
	// что читается неинициализированная переменная.
	// cout << b;

	b = 5;
	cout << "b = " << b << endl;

	// Чтение из потока ввода:
	cout << "Enter a: ";
	cin >> a;
	cout << "Enter b: ";
	cin >> b;

	int c = a + b;
	cout << "a + b = " << c << endl;

	// Присваивание нового значения.
	c = a * b;
	cout << "a * b = " << c << endl;

	cin.ignore();
	cin.ignore();
	return 0;
}
