// Hello World.

#include <iostream>

using namespace std;

// main
int main_HelloWorld()
{
	cout << "Hello";
	cin.ignore();
	return 0;
}

// Основные типы приложений: консольное, оконное, остальное
// Мы будем делать только консольные приложения
// Среды разработки:
//   VisualStudio
//   CLion
//   VSCode
//   ...
// Как создать консольное приложение в VisualStudio
//   Menu\File\New\Project...
//     Выбираем Templates\Visual C++\Win32\Win32 Console Application
//     Зполняем поля Name и Location
//     Жмём OK
//     В визарде убираем все галочки, чтобы не создавался лишний мусор
//     Жмём Finish
//     Создаётся проект, всё равно с кучей мусора
//     Работаем в файле <Имя проекта>.cpp
//   Вариант 2, совсем без мусора
//     То же самое, но в визарде создания проекта выставляем галочку Empty project
//     Создаётся проект без файлов
//     Добавляем в проект файл Main.cpp (имя любое):
//       Вызываем контекстное меню в Solution Explorer на элементе Source Files
//       Context menu\Add\New Item...\Visual C++\С++ File (.cpp)
//       В поле Name пишем имя файла (Main.cpp).
//       Жмём Add
//     Работаем в Main.cpp
// Пишем приложение Hello World
//   Код:
//     #include <iostream>
//     int main()
//     {
//       std::cout << "Hello";
//       return 0;
//     }
//   Объясняем строчки:
//     #include
//     Функция main
//       int - возвращаемое значение (целое число - код ошибки)
//       () - входные аргументы (ничего)
//       {...} - тело
//     std::cout
//       Всё, что нужно пока понимать, что выводить в консоль нужно так:
//         std::cout << что-то;
//       Пока это просто магическая строчка.
//       Но если кратко, то:
//         cout - глобальный объект потока вывода (без деталей, потом)
//         std:: - namespace стандартной библиотеки C++ (без деталей, потом)
//     "Hello" - строка (без деталей, потом)
//     ; - конец инструкции (statement)
//     return 0; - возвращаем из функции main нулевой код ошибки (успех)
//   Запускаем из студии (F5) - сразу завершается
//   Зупускаем под отладкой
//     Выставляем breakpoint (F9) после cout
//     Запускаем (F5)
//     Показываем консоль
//     Завершаем (F5)
//   Показываем exe-файл
//     <Папка пректа>\Debug\<Имя проекта>.cpp
//     Запускаем его двойным кликом
//     Запускаем из консоли
//   Добавляем std::cin.ignore();
//     Пока это просто магическая строчка
//     Но если кратко, то:
//       std::cin - глобальный объект потока ввода
//       ignore - его метод, ожидающий ввода и игнорирующий его.
//   Запускаем из студии
//   Запускаем exe-файл двойным кликом и из консоли
//   using namespace std;
//     Без деталей о том, что такое namespace
